zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXA/periph4/PERI_DIGTMP.h
#define DIGTMP_PGFR_TPSF_MASK                    (0xC00U)
#define DIGTMP_PGFR_TPSF_SHIFT                   (10U)
/*! TPSF - Tamper Pin Sample Frequency
 *  0b00..Every 8 cycles
 *  0b01..Every 32 cycles
 *  0b10..Every 128 cycles
 *  0b11..Every 512 cycles
 */
#define DIGTMP_PGFR_TPSF(x)                      (((uint32_t)(((uint32_t)(x)) << DIGTMP_PGFR_TPSF_SHIFT)) & DIGTMP_PGFR_TPSF_MASK)

#define DIGTMP_PGFR_TPE_MASK                     (0x1000000U)
#define DIGTMP_PGFR_TPE_SHIFT                    (24U)
/*! TPE - Tamper Pull Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define DIGTMP_PGFR_TPE(x)                       (((uint32_t)(((uint32_t)(x)) << DIGTMP_PGFR_TPE_SHIFT)) & DIGTMP_PGFR_TPE_MASK)

#define DIGTMP_PGFR_TPS_MASK                     (0x2000000U)
#define DIGTMP_PGFR_TPS_SHIFT                    (25U)
/*! TPS - Tamper Pull Select
 *  0b0..Asserts
 *  0b1..Negates
 */
#define DIGTMP_PGFR_TPS(x)                       (((uint32_t)(((uint32_t)(x)) << DIGTMP_PGFR_TPS_SHIFT)) & DIGTMP_PGFR_TPS_MASK)
/*! @} */

/*! @name WAC - Write Access Control */
/*! @{ */

#define DIGTMP_WAC_CRW_MASK                      (0x10U)
#define DIGTMP_WAC_CRW_SHIFT                     (4U)
/*! CRW - Control Register Write
 *  0b0..Writes to the Control register are ignored.
 *  0b1..Writes to the Control register complete as normal.
 */
#define DIGTMP_WAC_CRW(x)                        (((uint32_t)(((uint32_t)(x)) << DIGTMP_WAC_CRW_SHIFT)) & DIGTMP_WAC_CRW_MASK)

#define DIGTMP_WAC_SRW_MASK                      (0x20U)
#define DIGTMP_WAC_SRW_SHIFT                     (5U)
/*! SRW - Status Register Write
 *  0b0..Writes to the Status Register are ignored.
 *  0b1..Writes to the Status Register complete as normal.
 */
#define DIGTMP_WAC_SRW(x)                        (((uint32_t)(((uint32_t)(x)) << DIGTMP_WAC_SRW_SHIFT)) & DIGTMP_WAC_SRW_MASK)

#define DIGTMP_WAC_LRW_MASK                      (0x40U)
#define DIGTMP_WAC_LRW_SHIFT                     (6U)
/*! LRW - Lock Register Write
 *  0b0..Writes to the Lock register are ignored.
 *  0b1..Writes to the Lock register complete as normal.
 */
#define DIGTMP_WAC_LRW(x)                        (((uint32_t)(((uint32_t)(x)) << DIGTMP_WAC_LRW_SHIFT)) & DIGTMP_WAC_LRW_MASK)

#define DIGTMP_WAC_IEW_MASK                      (0x80U)
#define DIGTMP_WAC_IEW_SHIFT                     (7U)
/*! IEW - Interrupt Enable Write
 *  0b0..Writes to the Interrupt enable register are ignored.
 *  0b1..Writes to the Interrupt enable register complete as normal.
 */
#define DIGTMP_WAC_IEW(x)                        (((uint32_t)(((uint32_t)(x)) << DIGTMP_WAC_IEW_SHIFT)) & DIGTMP_WAC_IEW_MASK)

#define DIGTMP_WAC_TSRW_MASK                     (0x100U)
#define DIGTMP_WAC_TSRW_SHIFT                    (8U)
/*! TSRW - Tamper Seconds Register Write
 *  0b0..Writes to the Tamper Seconds register are ignored.
 *  0b1..Writes to the Tamper Seconds register complete as normal.
 */
#define DIGTMP_WAC_TSRW(x)                       (((uint32_t)(((uint32_t)(x)) << DIGTMP_WAC_TSRW_SHIFT)) & DIGTMP_WAC_TSRW_MASK)

#define DIGTMP_WAC_TEW_MASK                      (0x200U)
#define DIGTMP_WAC_TEW_SHIFT                     (9U)
/*! TEW - Tamper Enable Write
 *  0b0..Writes to the tamper enable register are ignored.
 *  0b1..Writes to the tamper enable register complete as normal.
 */
#define DIGTMP_WAC_TEW(x)                        (((uint32_t)(((uint32_t)(x)) << DIGTMP_WAC_TEW_SHIFT)) & DIGTMP_WAC_TEW_MASK)

#define DIGTMP_WAC_PPW_MASK                      (0x800U)
#define DIGTMP_WAC_PPW_SHIFT                     (11U)
/*! PPW - Pin Polarity Write
 *  0b0..Writes to the pin polarity register are ignored.
 *  0b1..Writes to the pin polarity register complete as normal.
 */
#define DIGTMP_WAC_PPW(x)                        (((uint32_t)(((uint32_t)(x)) << DIGTMP_WAC_PPW_SHIFT)) & DIGTMP_WAC_PPW_MASK)

#define DIGTMP_WAC_GFW0_MASK                     (0x10000U)
#define DIGTMP_WAC_GFW0_SHIFT                    (16U)
/*! GFW0 - Glitch Filter Write
 *  0b0..Writes are ignored
 *  0b1..Writes complete as normal
 */
#define DIGTMP_WAC_GFW0(x)                       (((uint32_t)(((uint32_t)(x)) << DIGTMP_WAC_GFW0_SHIFT)) & DIGTMP_WAC_GFW0_MASK)

#define DIGTMP_WAC_GFW1_MASK                     (0x20000U)
#define DIGTMP_WAC_GFW1_SHIFT                    (17U)
/*! GFW1 - Glitch Filter Write
 *  0b0..Writes are ignored
 *  0b1..Writes complete as normal
 */
#define DIGTMP_WAC_GFW1(x)                       (((uint32_t)(((uint32_t)(x)) << DIGTMP_WAC_GFW1_SHIFT)) & DIGTMP_WAC_GFW1_MASK)

#define DIGTMP_WAC_GFW2_MASK                     (0x40000U)
#define DIGTMP_WAC_GFW2_SHIFT                    (18U)
/*! GFW2 - Glitch Filter Write
 *  0b0..Writes are ignored
 *  0b1..Writes complete as normal
 */
#define DIGTMP_WAC_GFW2(x)                       (((uint32_t)(((uint32_t)(x)) << DIGTMP_WAC_GFW2_SHIFT)) & DIGTMP_WAC_GFW2_MASK)

#define DIGTMP_WAC_GFW3_MASK                     (0x80000U)
#define DIGTMP_WAC_GFW3_SHIFT                    (19U)
/*! GFW3 - Glitch Filter Write
 *  0b0..Writes are ignored
 *  0b1..Writes complete as normal
 */
#define DIGTMP_WAC_GFW3(x)                       (((uint32_t)(((uint32_t)(x)) << DIGTMP_WAC_GFW3_SHIFT)) & DIGTMP_WAC_GFW3_MASK)

#define DIGTMP_WAC_GFW4_MASK                     (0x100000U)
#define DIGTMP_WAC_GFW4_SHIFT                    (20U)
/*! GFW4 - Glitch Filter Write
 *  0b0..Writes are ignored
 *  0b1..Writes complete as normal
 */
#define DIGTMP_WAC_GFW4(x)                       (((uint32_t)(((uint32_t)(x)) << DIGTMP_WAC_GFW4_SHIFT)) & DIGTMP_WAC_GFW4_MASK)

#define DIGTMP_WAC_GFW5_MASK                     (0x200000U)
#define DIGTMP_WAC_GFW5_SHIFT                    (21U)
/*! GFW5 - Glitch Filter Write
 *  0b0..Writes are ignored
 *  0b1..Writes complete as normal
 */
#define DIGTMP_WAC_GFW5(x)                       (((uint32_t)(((uint32_t)(x)) << DIGTMP_WAC_GFW5_SHIFT)) & DIGTMP_WAC_GFW5_MASK)

#define DIGTMP_WAC_GFW6_MASK                     (0x400000U)
#define DIGTMP_WAC_GFW6_SHIFT                    (22U)
/*! GFW6 - Glitch Filter Write
 *  0b0..Writes are ignored
 *  0b1..Writes complete as normal
 */
#define DIGTMP_WAC_GFW6(x)                       (((uint32_t)(((uint32_t)(x)) << DIGTMP_WAC_GFW6_SHIFT)) & DIGTMP_WAC_GFW6_MASK)

#define DIGTMP_WAC_GFW7_MASK                     (0x800000U)
#define DIGTMP_WAC_GFW7_SHIFT                    (23U)
/*! GFW7 - Glitch Filter Write
 *  0b0..Writes are ignored
 *  0b1..Writes complete as normal
 */
#define DIGTMP_WAC_GFW7(x)                       (((uint32_t)(((uint32_t)(x)) << DIGTMP_WAC_GFW7_SHIFT)) & DIGTMP_WAC_GFW7_MASK)
/*! @} */

/*! @name RAC - Read Access Control */
/*! @{ */

#define DIGTMP_RAC_CRR_MASK                      (0x10U)
#define DIGTMP_RAC_CRR_SHIFT                     (4U)
/*! CRR - Control Register Read
 *  0b0..Reads to the Control register are ignored.
 *  0b1..Reads to the Control register complete as normal.
 */
#define DIGTMP_RAC_CRR(x)                        (((uint32_t)(((uint32_t)(x)) << DIGTMP_RAC_CRR_SHIFT)) & DIGTMP_RAC_CRR_MASK)

#define DIGTMP_RAC_SRR_MASK                      (0x20U)
#define DIGTMP_RAC_SRR_SHIFT                     (5U)
/*! SRR - Status Register Read
 *  0b0..Reads to the Status Register are ignored.
 *  0b1..Reads to the Status Register complete as normal.
 */
#define DIGTMP_RAC_SRR(x)                        (((uint32_t)(((uint32_t)(x)) << DIGTMP_RAC_SRR_SHIFT)) & DIGTMP_RAC_SRR_MASK)

#define DIGTMP_RAC_LRR_MASK                      (0x40U)
#define DIGTMP_RAC_LRR_SHIFT                     (6U)
/*! LRR - Lock Register Read
 *  0b0..Reads to the Lock register are ignored.
 *  0b1..Reads to the Lock register complete as normal.
 */
#define DIGTMP_RAC_LRR(x)                        (((uint32_t)(((uint32_t)(x)) << DIGTMP_RAC_LRR_SHIFT)) & DIGTMP_RAC_LRR_MASK)

