zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXA/periph4/PERI_DIGTMP.h
#define DIGTMP_RAC_IER_MASK                      (0x80U)
#define DIGTMP_RAC_IER_SHIFT                     (7U)
/*! IER - Interrupt Enable Read
 *  0b0..Reads to the Interrupt enable register are ignored.
 *  0b1..Reads to the Interrupt enable register complete as normal.
 */
#define DIGTMP_RAC_IER(x)                        (((uint32_t)(((uint32_t)(x)) << DIGTMP_RAC_IER_SHIFT)) & DIGTMP_RAC_IER_MASK)

#define DIGTMP_RAC_TSRR_MASK                     (0x100U)
#define DIGTMP_RAC_TSRR_SHIFT                    (8U)
/*! TSRR - Tamper Seconds Register Read
 *  0b0..Reads to the tamper seconds register are ignored.
 *  0b1..Reads to the tamper seconds register complete as normal.
 */
#define DIGTMP_RAC_TSRR(x)                       (((uint32_t)(((uint32_t)(x)) << DIGTMP_RAC_TSRR_SHIFT)) & DIGTMP_RAC_TSRR_MASK)

#define DIGTMP_RAC_TER_MASK                      (0x200U)
#define DIGTMP_RAC_TER_SHIFT                     (9U)
/*! TER - Tamper Enable Read
 *  0b0..Reads to the tamper enable register are ignored.
 *  0b1..Reads to the tamper enable register complete as normal.
 */
#define DIGTMP_RAC_TER(x)                        (((uint32_t)(((uint32_t)(x)) << DIGTMP_RAC_TER_SHIFT)) & DIGTMP_RAC_TER_MASK)

#define DIGTMP_RAC_PPR_MASK                      (0x800U)
#define DIGTMP_RAC_PPR_SHIFT                     (11U)
/*! PPR - Pin Polarity Read
 *  0b0..Reads to the pin polarity register are ignored.
 *  0b1..Reads to the pin polarity register complete as normal.
 */
#define DIGTMP_RAC_PPR(x)                        (((uint32_t)(((uint32_t)(x)) << DIGTMP_RAC_PPR_SHIFT)) & DIGTMP_RAC_PPR_MASK)

#define DIGTMP_RAC_GFR0_MASK                     (0x10000U)
#define DIGTMP_RAC_GFR0_SHIFT                    (16U)
/*! GFR0 - Glitch Filter Read
 *  0b0..Reads are ignored
 *  0b1..Reads complete as normal
 */
#define DIGTMP_RAC_GFR0(x)                       (((uint32_t)(((uint32_t)(x)) << DIGTMP_RAC_GFR0_SHIFT)) & DIGTMP_RAC_GFR0_MASK)

#define DIGTMP_RAC_GFR1_MASK                     (0x20000U)
#define DIGTMP_RAC_GFR1_SHIFT                    (17U)
/*! GFR1 - Glitch Filter Read
 *  0b0..Reads are ignored
 *  0b1..Reads complete as normal
 */
#define DIGTMP_RAC_GFR1(x)                       (((uint32_t)(((uint32_t)(x)) << DIGTMP_RAC_GFR1_SHIFT)) & DIGTMP_RAC_GFR1_MASK)

#define DIGTMP_RAC_GFR2_MASK                     (0x40000U)
#define DIGTMP_RAC_GFR2_SHIFT                    (18U)
/*! GFR2 - Glitch Filter Read
 *  0b0..Reads are ignored
 *  0b1..Reads complete as normal
 */
#define DIGTMP_RAC_GFR2(x)                       (((uint32_t)(((uint32_t)(x)) << DIGTMP_RAC_GFR2_SHIFT)) & DIGTMP_RAC_GFR2_MASK)

#define DIGTMP_RAC_GFR3_MASK                     (0x80000U)
#define DIGTMP_RAC_GFR3_SHIFT                    (19U)
/*! GFR3 - Glitch Filter Read
 *  0b0..Reads are ignored
 *  0b1..Reads complete as normal
 */
#define DIGTMP_RAC_GFR3(x)                       (((uint32_t)(((uint32_t)(x)) << DIGTMP_RAC_GFR3_SHIFT)) & DIGTMP_RAC_GFR3_MASK)

#define DIGTMP_RAC_GFR4_MASK                     (0x100000U)
#define DIGTMP_RAC_GFR4_SHIFT                    (20U)
/*! GFR4 - Glitch Filter Read
 *  0b0..Reads are ignored
 *  0b1..Reads complete as normal
 */
#define DIGTMP_RAC_GFR4(x)                       (((uint32_t)(((uint32_t)(x)) << DIGTMP_RAC_GFR4_SHIFT)) & DIGTMP_RAC_GFR4_MASK)

#define DIGTMP_RAC_GFR5_MASK                     (0x200000U)
#define DIGTMP_RAC_GFR5_SHIFT                    (21U)
/*! GFR5 - Glitch Filter Read
 *  0b0..Reads are ignored
 *  0b1..Reads complete as normal
 */
#define DIGTMP_RAC_GFR5(x)                       (((uint32_t)(((uint32_t)(x)) << DIGTMP_RAC_GFR5_SHIFT)) & DIGTMP_RAC_GFR5_MASK)

#define DIGTMP_RAC_GFR6_MASK                     (0x400000U)
#define DIGTMP_RAC_GFR6_SHIFT                    (22U)
/*! GFR6 - Glitch Filter Read
 *  0b0..Reads are ignored
 *  0b1..Reads complete as normal
 */
#define DIGTMP_RAC_GFR6(x)                       (((uint32_t)(((uint32_t)(x)) << DIGTMP_RAC_GFR6_SHIFT)) & DIGTMP_RAC_GFR6_MASK)

#define DIGTMP_RAC_GFR7_MASK                     (0x800000U)
#define DIGTMP_RAC_GFR7_SHIFT                    (23U)
/*! GFR7 - Glitch Filter Read
 *  0b0..Reads are ignored
 *  0b1..Reads complete as normal
 */
#define DIGTMP_RAC_GFR7(x)                       (((uint32_t)(((uint32_t)(x)) << DIGTMP_RAC_GFR7_SHIFT)) & DIGTMP_RAC_GFR7_MASK)
/*! @} */


/*!
 * @}
 */ /* end of group DIGTMP_Register_Masks */


/*!
 * @}
 */ /* end of group DIGTMP_Peripheral_Access_Layer */


/*
** End of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic pop
  #else
    #pragma pop
  #endif
#elif defined(__GNUC__)
  /* leave anonymous unions enabled */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=default
#else
  #error Not supported compiler type
#endif

/*!
 * @}
 */ /* end of group Peripheral_access_layer */


#endif  /* PERI_DIGTMP_H_ */

